home6.org
#+PROPERTY: header-args :results output :exports both :tangle home6.scm
#+PROPERTY: header-args:scheme  :session *scheme*
#+TITLE: Домашнее задание №6
Реализуйте разбор арифметического выражения, записанного в традиционной
инфиксной нотации, и его преобразование к выражению, записанному на
языке Scheme. Выражения могут включать в себя числа (целые и с плавающей
запятой, в том числе --- в экспоненциальной форме), переменные (имена
переменных могут состоять из одной или нескольких латинских букв),
арифметические операции (=+=, =−=, =*=, =/= и =^=), унарный минус и
круглые скобки.

Задание выполните в три этапа:

* 1. Лексический анализатор
   :PROPERTIES:
   :CUSTOM_ID: лексический-анализатор
   :END:
Разработайте лексическую структуру языка (грамматику разбора
арифметического выражения на токены) и запишите ее в БНФ перед главной
процедурой лексера. Процедура должна называться =tokenize=, принимать
выражение в виде строки и возвращать последовательность токенов в виде
списка. Лексемы исходной последовательности должны быть преобразованы:

имена переменных и знаки операций --- в символические константы Scheme,
числа --- в числовые константы Scheme соответствующего типа, скобки ---
в строки ="("= и =")"=. Пробельные символы должны игнорироваться
лексером. Если исходная последовательность включает в себя недопустимые
символы, лексер должен возвращать =#f=.

Примеры вызова лексера:

#+begin_example
  (tokenize "1")
    ⇒ (1)

  (tokenize "-a")
    ⇒ (- a)

  (tokenize "-a + b * x^2 + dy")
    ⇒ (- a + b * x ^ 2 + dy)

  (tokenize "(a - 1)/(b + 1)")
    ⇒ ("(" a - 1 ")" / "(" b + 1 ")")
#+end_example

** БНФ
#+begin_example
<выражение>        ::= <пробелы> <объект> <пробелы> <выражение> | <пусто>
<пробелы>          ::= ПРОБЕЛ <пробелы> | <пусто>
<объект>           ::= (
                     | )
                     | +
                     | -
                     | *
                     | /
                     | ^
                     | <переменная>
                     | <число>
<число>            ::= ЦИФРА <хвост-числа>
<хвост-числа>      ::= ЦИФРА <хвост-числа> | e <хвост-числа> | . <хвост-числа> | <пусто>
<переменная>       ::= БУКВА <хвост-переменной>
<хвост-переменной> ::= БУКВА <хвост-переменной> | <пусто>
<пусто>            ::=
#+end_example

