home6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-13 Mon 16:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Домашнее задание №6</title>
<meta name="author" content="Starovoytov Alexandr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Домашнее задание №6</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#лексический-анализатор">1. 1. Лексический анализатор</a>
<ul>
<li><a href="#org6c89f88">1.1. БНФ</a></li>
<li><a href="#orgd51cfce">1.2. Реализация</a></li>
<li><a href="#org8af69ed">1.3. Тесты</a></li>
</ul>
</li>
<li><a href="#синтаксический-анализатор">2. 2. Синтаксический анализатор</a>
<ul>
<li><a href="#org797b63b">2.1. Реализация</a></li>
<li><a href="#org2a0d6fc">2.2. Тесты</a></li>
</ul>
</li>
<li><a href="#преобразователь-дерева-разбора-в-выражение-на-scheme">3. 3. Преобразователь дерева разбора в выражение на Scheme</a>
<ul>
<li><a href="#orgc40053d">3.1. Реализация</a></li>
<li><a href="#org6d0d981">3.2. Тесты</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Реализуйте разбор арифметического выражения, записанного в традиционной
инфиксной нотации, и его преобразование к выражению, записанному на
языке Scheme. Выражения могут включать в себя числа (целые и с плавающей
запятой, в том числе &#x2014; в экспоненциальной форме), переменные (имена
переменных могут состоять из одной или нескольких латинских букв),
арифметические операции (<code>+</code>, <code>−</code>, <code>*</code>, <code>/</code> и <code>^</code>), унарный минус и
круглые скобки.
</p>

<p>
Задание выполните в три этапа:
</p>

<div id="outline-container-лексический-анализатор" class="outline-2">
<h2 id="лексический-анализатор"><span class="section-number-2">1.</span> 1. Лексический анализатор</h2>
<div class="outline-text-2" id="text-лексический-анализатор">
<p>
Разработайте лексическую структуру языка (грамматику разбора
арифметического выражения на токены) и запишите ее в БНФ перед главной
процедурой лексера. Процедура должна называться <code>tokenize</code>, принимать
выражение в виде строки и возвращать последовательность токенов в виде
списка. Лексемы исходной последовательности должны быть преобразованы:
</p>

<p>
имена переменных и знаки операций &#x2014; в символические константы Scheme,
числа &#x2014; в числовые константы Scheme соответствующего типа, скобки &#x2014;
в строки <code>"("</code> и <code>")"</code>. Пробельные символы должны игнорироваться
лексером. Если исходная последовательность включает в себя недопустимые
символы, лексер должен возвращать <code>#f</code>.
</p>

<p>
Примеры вызова лексера:
</p>

<pre class="example" id="org70c3be8">
  (tokenize "1")
    ⇒ (1)

  (tokenize "-a")
    ⇒ (- a)

  (tokenize "-a + b * x^2 + dy")
    ⇒ (- a + b * x ^ 2 + dy)

  (tokenize "(a - 1)/(b + 1)")
    ⇒ ("(" a - 1 ")" / "(" b + 1 ")")
</pre>
</div>

<div id="outline-container-org6c89f88" class="outline-3">
<h3 id="org6c89f88"><span class="section-number-3">1.1.</span> БНФ</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example" id="org82a4544">
&lt;выражение&gt;        ::= &lt;пробелы&gt; &lt;объект&gt; &lt;пробелы&gt; &lt;выражение&gt; | &lt;пусто&gt;
&lt;пробелы&gt;          ::= ПРОБЕЛ &lt;пробелы&gt; | &lt;пусто&gt;
&lt;объект&gt;           ::= (
                     | )
                     | +
                     | -
                     | *
                     | /
                     | ^
                     | &lt;переменная&gt;
                     | &lt;число&gt;
&lt;число&gt;            ::= ЦИФРА &lt;хвост-числа&gt;
&lt;хвост-числа&gt;      ::= ЦИФРА &lt;хвост-числа&gt; | e &lt;хвост-числа&gt; | . &lt;хвост-числа&gt; | &lt;пусто&gt;
&lt;переменная&gt;       ::= БУКВА &lt;хвост-переменной&gt;
&lt;хвост-переменной&gt; ::= БУКВА &lt;хвост-переменной&gt; | &lt;пусто&gt;
&lt;пусто&gt;            ::=
</pre>
</div>
</div>
