home6.org
** Реализация
#+begin_src scheme :results none
(define (tokenize str)
  (load "appendix/parser/stream.scm")
  (define (expression stream error)
    (cond ((and (char? (peek stream))
                (or (char-whitespace? (peek stream))
                    (member (peek stream)
                            '(#\( #\) #\+ #\- #\* #\/ #\^))
                    (char-alphabetic? (peek stream))
                    (char-numeric? (peek stream))))
           (spaces stream error)
           (let* ((t-object (object stream error))
                  (t-spaces (spaces stream error))
                  (t-expr (expression stream error)))
             (cons t-object t-expr)))
          (else '())))
  (define (spaces stream error)
    (cond ((and (char? (peek stream))
                (char-whitespace? (peek stream)))
           (next stream)
           (spaces stream error))
          (else '())))
  (define (object stream error)
    (cond ((assoc (peek stream) '((#\( "(")
                                  (#\) ")")
                                  (#\+ +)
                                  (#\- -)
                                  (#\* *)
                                  (#\/ /)
                                  (#\^ ^))) => (lambda (ret)
                                                  (next stream)
                                                  (cadr ret)))
          ((and (char? (peek stream))
                (char-alphabetic? (peek stream)))
           (variable stream error))
          ((and (char? (peek stream))
                (char-numeric? (peek stream)))
           (number stream error))
          (else (error #f))))
  (define (number stream error)
    (cond ((and (char? (peek stream))
                (char-numeric? (peek stream)))
           (let* ((n (next stream))
                  (n-tail (number-tail stream error)))
             (string->number (list->string (cons n n-tail)))))
          (else (error #f))))
  (define (number-tail stream error)
    (cond ((and (char? (peek stream))
                (or (char-numeric? (peek stream))
                    (char=? #\e (peek stream))
                    (char=? #\. (peek stream))))
           (let* ((n (next stream))
                  (n-tail (number-tail stream error)))
             (cons n n-tail)))
          (else '())))
  (define (variable stream error)
    (cond ((and (char? (peek stream))
                (char-alphabetic? (peek stream)))
           (let* ((letter (next stream))
                  (var-tail (variable-tail stream error)))
             (string->symbol (list->string (cons letter var-tail)))))
          (else (error #f))))
  (define (variable-tail stream error)
    (cond ((and (char? (peek stream))
                (char-alphabetic? (peek stream)))
           (let* ((letter (next stream))
                  (var-tail (variable-tail stream error)))
             (cons letter var-tail)))
          (else '())))
  (define stream (make-stream (string->list str) 'EOF))
  (call-with-current-continuation
   (lambda (error)
     (define res (expression stream error))
     (and (eqv? (peek stream) 'EOF)
          res))))
#+end_src

