home6.html

<div id="outline-container-orgd51cfce" class="outline-3">
<h3 id="orgd51cfce"><span class="section-number-3">1.2.</span> Реализация</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">tokenize</span> str<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>load <span style="color: #98be65;">"appendix/parser/stream.scm"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">expression</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span><span style="color: #51afef;">or</span> <span style="color: #98be65;">(</span>char-whitespace? <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span>member <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span>
                            '<span style="color: #a9a1e1;">(</span>#\( #\) #\+ #\- #\* #\/ #\^<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span>char-alphabetic? <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span>char-numeric? <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>spaces stream error<span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>t-object <span style="color: #a9a1e1;">(</span>object stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>t-spaces <span style="color: #a9a1e1;">(</span>spaces stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>t-expr <span style="color: #a9a1e1;">(</span>expression stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>cons t-object t-expr<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> '<span style="color: #51afef;">()</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">spaces</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-whitespace? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>spaces stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> '<span style="color: #51afef;">()</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">object</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>assoc <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span> '<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>#\( <span style="color: #98be65;">"("</span><span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\) <span style="color: #98be65;">")"</span><span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\+ +<span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\- -<span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\* *<span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\/ /<span style="color: #98be65;">)</span>
                                  <span style="color: #98be65;">(</span>#\^ ^<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> =&gt; <span style="color: #51afef;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #c678dd;">(</span>ret<span style="color: #c678dd;">)</span>
                                                  <span style="color: #c678dd;">(</span>next stream<span style="color: #c678dd;">)</span>
                                                  <span style="color: #c678dd;">(</span>cadr ret<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-alphabetic? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>variable stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-numeric? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>number stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> <span style="color: #51afef;">(</span>error #f<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">number</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-numeric? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>n <span style="color: #a9a1e1;">(</span>next stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>n-tail <span style="color: #a9a1e1;">(</span>number-tail stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>string-&gt;number <span style="color: #98be65;">(</span>list-&gt;string <span style="color: #a9a1e1;">(</span>cons n n-tail<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> <span style="color: #51afef;">(</span>error #f<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">number-tail</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span><span style="color: #51afef;">or</span> <span style="color: #98be65;">(</span>char-numeric? <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span>char=? #\e <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span>char=? #\. <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>n <span style="color: #a9a1e1;">(</span>next stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>n-tail <span style="color: #a9a1e1;">(</span>number-tail stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>cons n n-tail<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> '<span style="color: #51afef;">()</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">variable</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-alphabetic? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>letter <span style="color: #a9a1e1;">(</span>next stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>var-tail <span style="color: #a9a1e1;">(</span>variable-tail stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>string-&gt;symbol <span style="color: #98be65;">(</span>list-&gt;string <span style="color: #a9a1e1;">(</span>cons letter var-tail<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> <span style="color: #51afef;">(</span>error #f<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">variable-tail</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>char? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #c678dd;">(</span>char-alphabetic? <span style="color: #98be65;">(</span>peek stream<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>letter <span style="color: #a9a1e1;">(</span>next stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>var-tail <span style="color: #a9a1e1;">(</span>variable-tail stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>cons letter var-tail<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> '<span style="color: #51afef;">()</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">stream</span> <span style="color: #98be65;">(</span>make-stream <span style="color: #a9a1e1;">(</span>string-&gt;list str<span style="color: #a9a1e1;">)</span> 'EOF<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">call-with-current-continuation</span>
   <span style="color: #98be65;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #a9a1e1;">(</span>error<span style="color: #a9a1e1;">)</span>
     <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">res</span> <span style="color: #51afef;">(</span>expression stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
     <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">and</span> <span style="color: #51afef;">(</span>eqv? <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span> 'EOF<span style="color: #51afef;">)</span>
          res<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
