home6.org
** Тесты
#+begin_src scheme :eval never
(load "unit-test.scm")

(define tokenize-tests
  (list (test (tokenize "1")
              (1))
        (test (tokenize "-a")
              (- a))
        (test (tokenize "-a + b * x^2 + dy")
              (- a + b * x ^ 2 + dy))
        (test (tokenize "(a - 1)/(b + 1)")
              ("(" a - 1 ")" / "(" b + 1 ")"))))

(run-tests tokenize-tests)
#+end_src

#+RESULTS:
: Test 1: (tokenize "1") ok
: Test 2: (tokenize "-a") ok
: Test 3: (tokenize "-a + b * x^2 + dy") ok
: Test 4: (tokenize "(a - 1)/(b + 1)") ok

* 2. Синтаксический анализатор
   :PROPERTIES:
   :CUSTOM_ID: синтаксический-анализатор
   :END:
Синтаксический анализатор должен строить дерево разбора согласно
следующей грамматике, учитывающей приоритет операторов:

#+begin_example
  Expr    ::= Term Expr' .
  Expr'   ::= AddOp Term Expr' | .
  Term    ::= Factor Term' .
  Term'   ::= MulOp Factor Term' | .
  Factor  ::= Power Factor' .
  Factor' ::= PowOp Power Factor' | .
  Power   ::= value | "(" Expr ")" | unaryMinus Power .
#+end_example

- /Кажется, в предложенной грамматике неверный приоритет у унарного минуса:/
  #+begin_example
-10^2 -> (-10)^2
  #+end_example

где терминалами являются =value= (число или переменная), круглые скобки
и знаки операций.

Синтаксический анализатор реализуйте в виде процедуры =parse=,
принимающую последовательность токенов в виде списка (результат работы
=tokenize=) и возвращающую дерево разбора, представленное в виде
вложенных списков вида =(операнд-1 знак-операции операнд-2)= для
бинарных операций и =(− операнд)= для унарного минуса. Числа и
переменные в списки не упаковывайте. Многократно вложенные друг в друга
списки из одного элемента вида =(((имя-или-число)))= не допускаются.

Разбор осуществляйте методом рекурсивного спуска. Если исходная
последовательность не соответствует грамматике, парсер должен возвращать
=#f=.

При построении дерева разбора соблюдайте общепринятую ассоциативность
бинарых операторов: левую для сложения, вычитания, умножения и деления и
правую для возведения в степень. Вложенность списков должна однозначно
определять порядок вычисления значения выражения.

Примеры вызова парсера:

#+begin_example
  ; Ассоциативность левая
  ;
  (parse (tokenize "a/b/c/d"))
    ⇒ (((a / b) / c) / d)

  ; Ассоциативность правая
  ;
  (parse (tokenize "a^b^c^d"))
    ⇒ (a ^ (b ^ (c ^ d)))

  ; Порядок вычислений задан скобками
  ;
  (parse (tokenize "a/(b/c)"))
    ⇒ (a / (b / c))

  ; Порядок вычислений определен только
  ; приоритетом операций
  ;
  (parse (tokenize "a + b/c^2 - d"))
    ⇒ ((a + (b / (c ^ 2))) - d)
#+end_example

