home6.html

<div id="outline-container-org8af69ed" class="outline-3">
<h3 id="org8af69ed"><span class="section-number-3">1.3.</span> Тесты</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>load <span style="color: #98be65;">"unit-test.scm"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">tokenize-tests</span>
  <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>tokenize <span style="color: #98be65;">"1"</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>tokenize <span style="color: #98be65;">"-a"</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span>- a<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>tokenize <span style="color: #98be65;">"-a + b * x^2 + dy"</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span>- a + b * x ^ <span style="color: #da8548; font-weight: bold;">2</span> + dy<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>tokenize <span style="color: #98be65;">"(a - 1)/(b + 1)"</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"("</span> a - <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #98be65;">")"</span> / <span style="color: #98be65;">"("</span> b + <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #98be65;">")"</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>run-tests tokenize-tests<span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
Test 1: (tokenize "1") ok
Test 2: (tokenize "-a") ok
Test 3: (tokenize "-a + b * x^2 + dy") ok
Test 4: (tokenize "(a - 1)/(b + 1)") ok
</pre>
</div>
</div>
</div>

<div id="outline-container-синтаксический-анализатор" class="outline-2">
<h2 id="синтаксический-анализатор"><span class="section-number-2">2.</span> 2. Синтаксический анализатор</h2>
<div class="outline-text-2" id="text-синтаксический-анализатор">
<p>
Синтаксический анализатор должен строить дерево разбора согласно
следующей грамматике, учитывающей приоритет операторов:
</p>

<pre class="example" id="org0d3c18b">
  Expr    ::= Term Expr' .
  Expr'   ::= AddOp Term Expr' | .
  Term    ::= Factor Term' .
  Term'   ::= MulOp Factor Term' | .
  Factor  ::= Power Factor' .
  Factor' ::= PowOp Power Factor' | .
  Power   ::= value | "(" Expr ")" | unaryMinus Power .
</pre>

<ul class="org-ul">
<li><p>
<i>Кажется, в предложенной грамматике неверный приоритет у унарного минуса:</i>
</p>
<pre class="example" id="org9b8592c">
-10^2 -&gt; (-10)^2
</pre></li>
</ul>

<p>
где терминалами являются <code>value</code> (число или переменная), круглые скобки
и знаки операций.
</p>

<p>
Синтаксический анализатор реализуйте в виде процедуры <code>parse</code>,
принимающую последовательность токенов в виде списка (результат работы
<code>tokenize</code>) и возвращающую дерево разбора, представленное в виде
вложенных списков вида <code>(операнд-1 знак-операции операнд-2)</code> для
бинарных операций и <code>(− операнд)</code> для унарного минуса. Числа и
переменные в списки не упаковывайте. Многократно вложенные друг в друга
списки из одного элемента вида <code>(((имя-или-число)))</code> не допускаются.
</p>

<p>
Разбор осуществляйте методом рекурсивного спуска. Если исходная
последовательность не соответствует грамматике, парсер должен возвращать
<code>#f</code>.
</p>

<p>
При построении дерева разбора соблюдайте общепринятую ассоциативность
бинарых операторов: левую для сложения, вычитания, умножения и деления и
правую для возведения в степень. Вложенность списков должна однозначно
определять порядок вычисления значения выражения.
</p>

<p>
Примеры вызова парсера:
</p>

<pre class="example" id="org3a996ad">
  ; Ассоциативность левая
  ;
  (parse (tokenize "a/b/c/d"))
    ⇒ (((a / b) / c) / d)

  ; Ассоциативность правая
  ;
  (parse (tokenize "a^b^c^d"))
    ⇒ (a ^ (b ^ (c ^ d)))

  ; Порядок вычислений задан скобками
  ;
  (parse (tokenize "a/(b/c)"))
    ⇒ (a / (b / c))

  ; Порядок вычислений определен только
  ; приоритетом операций
  ;
  (parse (tokenize "a + b/c^2 - d"))
    ⇒ ((a + (b / (c ^ 2))) - d)
</pre>
</div>
