home6.html

<div id="outline-container-org797b63b" class="outline-3">
<h3 id="org797b63b"><span class="section-number-3">2.1.</span> Реализация</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">parse</span> tokens<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>load <span style="color: #98be65;">"appendix/parser/stream.scm"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">expr</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>res <span style="color: #c678dd;">(</span>term stream error<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
      <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">cond</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">or</span> <span style="color: #98be65;">(</span>eqv? '+ <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span>eqv? '- <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span><span style="color: #51afef;">let*</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>op <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                    <span style="color: #a9a1e1;">(</span>t-term <span style="color: #51afef;">(</span>term stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
               <span style="color: #98be65;">(</span>loop <span style="color: #a9a1e1;">(</span>list res op t-term<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
            <span style="color: #51afef;">(</span><span style="color: #51afef;">else</span> res<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">term</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>res <span style="color: #c678dd;">(</span>factor stream error<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
      <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">cond</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">or</span> <span style="color: #98be65;">(</span>eqv? '* <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span>eqv? '/ <span style="color: #a9a1e1;">(</span>peek stream<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span><span style="color: #51afef;">let*</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>op <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                    <span style="color: #a9a1e1;">(</span>t-factor <span style="color: #51afef;">(</span>factor stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
               <span style="color: #98be65;">(</span>loop <span style="color: #a9a1e1;">(</span>list res op t-factor<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
            <span style="color: #51afef;">(</span><span style="color: #51afef;">else</span> res<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">factor</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">let*</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>t-power <span style="color: #c678dd;">(</span>power stream error<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>t-factor1 <span style="color: #c678dd;">(</span>factor1 stream error<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
      <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>null? t-factor1<span style="color: #51afef;">)</span>
          t-power
          <span style="color: #51afef;">(</span>cons t-power t-factor1<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">factor1</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>eqv? '^ <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let*</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>t-power <span style="color: #a9a1e1;">(</span>power stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                  <span style="color: #98be65;">(</span>t-factor1 <span style="color: #a9a1e1;">(</span>factor1 stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>null? t-factor1<span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span>cons '^ <span style="color: #a9a1e1;">(</span>list t-power<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span>list '^ <span style="color: #a9a1e1;">(</span>cons t-power t-factor1<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> '<span style="color: #51afef;">()</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">power</span> stream error<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>number? <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>equal? <span style="color: #98be65;">"("</span> <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>t-expr <span style="color: #a9a1e1;">(</span>expr stream error<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
             <span style="color: #c678dd;">(</span>next stream<span style="color: #c678dd;">)</span>
             t-expr<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>eqv? '- <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>list '- <span style="color: #c678dd;">(</span>power stream error<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>symbol? <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span>next stream<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">else</span> <span style="color: #51afef;">(</span>error #f<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">stream</span> <span style="color: #98be65;">(</span>make-stream tokens <span style="color: #98be65;">"EOF"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">call-with-current-continuation</span>
   <span style="color: #98be65;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #a9a1e1;">(</span>error<span style="color: #a9a1e1;">)</span>
     <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">res</span> <span style="color: #51afef;">(</span>expr stream error<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
     <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">and</span> <span style="color: #51afef;">(</span>equal? <span style="color: #c678dd;">(</span>peek stream<span style="color: #c678dd;">)</span> <span style="color: #98be65;">"EOF"</span><span style="color: #51afef;">)</span>
          res<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
