home6.org
** Тесты
#+begin_src scheme :eval never
(load "unit-test.scm")

(define parse-tests
  (list (test (parse (tokenize "a + b + c+d"))
              (((a + b) + c) + d))
        (test (parse (tokenize "a/b/c/d"))
              (((a / b) / c) / d))
        (test (parse (tokenize "a^b^c^d"))
              (a ^ (b ^ (c ^ d))))
        (test (parse (tokenize "a/(b/c)"))
              (a / (b / c)))
        (test (parse (tokenize "a + b/c^2 - d"))
              ((a + (b / (c ^ 2))) - d))
        (test (parse (tokenize "(-a)^1e10"))
              ((- a) ^ 1e10))))

(run-tests parse-tests)
#+end_src

#+RESULTS:
: Test 1: (parse (tokenize "a + b + c+d")) ok
: Test 2: (parse (tokenize "a/b/c/d")) ok
: Test 3: (parse (tokenize "a^b^c^d")) ok
: Test 4: (parse (tokenize "a/(b/c)")) ok
: Test 5: (parse (tokenize "a + b/c^2 - d")) ok
: Test 6: (parse (tokenize "(-a)^1e10")) ok

* 3. Преобразователь дерева разбора в выражение на Scheme
   :PROPERTIES:
   :CUSTOM_ID: преобразователь-дерева-разбора-в-выражение-на-scheme
   :END:
Реализуйте процедуру =tree->scheme=, преобразующую дерево, возвращенное
процедурой =parse=, в выражение на языке Scheme. Полученное выражение
должно быть пригодно для вычисления его значения интерпретатором языка
Scheme.

Для возведения в степень используйте встроенную процедуру Scheme =expt=.
Не передавайте более двух аргументов встроенным процедурам для
арифметических операций.

Примеры вызова конвертера:

#+begin_example
  (tree->scheme (parse (tokenize "x^(a + 1)")))
    ⇒ (expt x (+ a 1))

  (eval (tree->scheme (parse (tokenize "2^2^2^2")))
        (interaction-environment))
    ⇒ 65536
#+end_example

** Реализация
#+begin_src scheme :results none
(define (tree->scheme tree)
  (cond ((not (list? tree))
         tree)
        ((eqv? '- (car tree))
         (list '- (tree->scheme (cadr tree))))
        ((eqv? '^ (cadr tree))
         (list 'expt
               (tree->scheme (car tree))
               (tree->scheme (caddr tree))))
        (else (list (cadr tree)
                    (tree->scheme (car tree))
                    (tree->scheme (caddr tree))))))
#+end_src
** Тесты
#+begin_src scheme :eval never
(load "unit-test.scm")

(define tree->scheme-tests
  (list (test (tree->scheme (parse (tokenize "x^(a + 1)")))
              (expt x (+ a 1)))
        (test (eval (tree->scheme (parse (tokenize "2^2^2^2")))
                    (interaction-environment))
              65536)))

(run-tests tree->scheme-tests)
#+end_src

#+RESULTS:
: Test 1: (tree->scheme (parse (tokenize "x^(a + 1)"))) ok
: Test 2: (eval (tree->scheme (parse (tokenize "2^2^2^2"))) (interaction-environment)) ok
