home6.html
<div id="outline-container-org2a0d6fc" class="outline-3">
<h3 id="org2a0d6fc"><span class="section-number-3">2.2.</span> Тесты</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>load <span style="color: #98be65;">"unit-test.scm"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">parse-tests</span>
  <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"a + b + c+d"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span>a + b<span style="color: #c678dd;">)</span> + c<span style="color: #51afef;">)</span> + d<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"a/b/c/d"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span>a / b<span style="color: #c678dd;">)</span> / c<span style="color: #51afef;">)</span> / d<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"a^b^c^d"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span>a ^ <span style="color: #51afef;">(</span>b ^ <span style="color: #c678dd;">(</span>c ^ d<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"a/(b/c)"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span>a / <span style="color: #51afef;">(</span>b / c<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"a + b/c^2 - d"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>a + <span style="color: #c678dd;">(</span>b / <span style="color: #98be65;">(</span>c ^ <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> - d<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>parse <span style="color: #51afef;">(</span>tokenize <span style="color: #98be65;">"(-a)^1e10"</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">(</span>- a<span style="color: #51afef;">)</span> ^ <span style="color: #da8548; font-weight: bold;">1e10</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>run-tests parse-tests<span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
Test 1: (parse (tokenize "a + b + c+d")) ok
Test 2: (parse (tokenize "a/b/c/d")) ok
Test 3: (parse (tokenize "a^b^c^d")) ok
Test 4: (parse (tokenize "a/(b/c)")) ok
Test 5: (parse (tokenize "a + b/c^2 - d")) ok
Test 6: (parse (tokenize "(-a)^1e10")) ok
</pre>
</div>
</div>
</div>

<div id="outline-container-преобразователь-дерева-разбора-в-выражение-на-scheme" class="outline-2">
<h2 id="преобразователь-дерева-разбора-в-выражение-на-scheme"><span class="section-number-2">3.</span> 3. Преобразователь дерева разбора в выражение на Scheme</h2>
<div class="outline-text-2" id="text-преобразователь-дерева-разбора-в-выражение-на-scheme">
<p>
Реализуйте процедуру <code>tree-&gt;scheme</code>, преобразующую дерево, возвращенное
процедурой <code>parse</code>, в выражение на языке Scheme. Полученное выражение
должно быть пригодно для вычисления его значения интерпретатором языка
Scheme.
</p>

<p>
Для возведения в степень используйте встроенную процедуру Scheme <code>expt</code>.
Не передавайте более двух аргументов встроенным процедурам для
арифметических операций.
</p>

<p>
Примеры вызова конвертера:
</p>

<pre class="example" id="orga5de7ff">
  (tree-&gt;scheme (parse (tokenize "x^(a + 1)")))
    ⇒ (expt x (+ a 1))

  (eval (tree-&gt;scheme (parse (tokenize "2^2^2^2")))
        (interaction-environment))
    ⇒ 65536
</pre>
</div>

<div id="outline-container-orgc40053d" class="outline-3">
<h3 id="orgc40053d"><span class="section-number-3">3.1.</span> Реализация</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">tree-&gt;scheme</span> tree<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">cond</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>not <span style="color: #51afef;">(</span>list? tree<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
         tree<span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>eqv? '- <span style="color: #51afef;">(</span>car tree<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
         <span style="color: #a9a1e1;">(</span>list '- <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>cadr tree<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>eqv? '^ <span style="color: #51afef;">(</span>cadr tree<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
         <span style="color: #a9a1e1;">(</span>list 'expt
               <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>car tree<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
               <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>caddr tree<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span><span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">(</span>list <span style="color: #51afef;">(</span>cadr tree<span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>car tree<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>caddr tree<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d0d981" class="outline-3">
<h3 id="org6d0d981"><span class="section-number-3">3.2.</span> Тесты</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>load <span style="color: #98be65;">"unit-test.scm"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">tree-&gt;scheme-tests</span>
  <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>tree-&gt;scheme <span style="color: #51afef;">(</span>parse <span style="color: #c678dd;">(</span>tokenize <span style="color: #98be65;">"x^(a + 1)"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #a9a1e1;">(</span>expt x <span style="color: #51afef;">(</span>+ a <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>test <span style="color: #a9a1e1;">(</span>eval <span style="color: #51afef;">(</span>tree-&gt;scheme <span style="color: #c678dd;">(</span>parse <span style="color: #98be65;">(</span>tokenize <span style="color: #98be65;">"2^2^2^2"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span>interaction-environment<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
              <span style="color: #da8548; font-weight: bold;">65536</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>run-tests tree-&gt;scheme-tests<span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
Test 1: (tree-&gt;scheme (parse (tokenize "x^(a + 1)"))) ok
Test 2: (eval (tree-&gt;scheme (parse (tokenize "2^2^2^2"))) (interaction-environment)) ok
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Starovoytov Alexandr</p>
<p class="date">Created: 2021-12-13 Mon 16:48</p>
</div>
</body>
</html>
